#language: ru
@withdrawal

Функционал: Тестирование калькулятора

  Сценарий: Сложение
    Когда взяли калькулятор
    И сложили число 2 и число 1
    Тогда должны получить ответ 3

  Сценарий: Вычитание
    Когда взяли калькулятор
    И вычли число 5 и число 2
    Тогда должны получить ответ 3

  Сценарий: Умножение
    Когда взяли калькулятор
    И умножили число 5 и число 2
    Тогда должны получить ответ 10

  Сценарий: Деление
    Когда взяли калькулятор
    И разделили число 8 и число 2
    Тогда должны получить ответ 4